# 巻尺は死語？
研究室で「巻尺誰か持ってない？貸して？」と言ったら「なんですかそれ？」と一人に言われ、他の人に「メジャーのことですか？」と聞かれて驚愕したので、アンケートをとってみました。<br />
<br />
<blockquote class="twitter-tweet" data-lang="ja"><p lang="ja" dir="ltr">今日、若者相手に「巻尺」と言ったら「なんですかそれ？」「メジャーのことですか？」と聞き返されたんですが、巻尺って死語になりつつあるんですか？</p>&mdash; Ryuichi Ueda (\@ryuichiueda) <a href="https://twitter.com/ryuichiueda/status/872718124289622016">2017年6月8日</a></blockquote> <script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script><br />
<br />
<br />
ということで「使わない」が多数派を占めたので、今後なくなっていく単語のようです。猿股とか大八車とかと同じくらいの死にゆく単語なんでしょうか。<br />
<br />
<br />
いつもそうですが、こういう話題を投げると知らない人からいろいろリプがありますが、知らない人からのは全く必要ない野次であんまり知見は得られませんでした。<br />
<br />
あと、「商品名でこういうものを呼ぶオッサンが許せない」みたいな意見も、リプではなく検索か何かでたまたま目に入りましたが、そういう文化もあるんであんまり腹立てるのは健康に悪いと思います。こういう人はアメリカ人がゲーム機を「ニンテンドー」とか言っているとむしろ喜びそうですが。オッサンが気になるんでしょう。<br />
<br />
あと、シェルスクリプトをシェルと言うなというのもありますね。論文とかだとダメだけど、普段使う自然言語は文脈依存なのでいいんじゃないですかね。パブリックに言ってもそれこそ文脈がわからんので無駄です。文脈をすっ飛ばしてそんなこと言ってもパブリックには伝わりません。言いたいことが伝わってないのはあなたです。<br />
<br />
そう言っている私も、こいつクソだと思う人間については何やってても腹立つので気持ちはよくわかります。なんでこんなに毒吐いてるのか。<br />
<br />
<br />
巻尺は結局、研究室の人に貸してもらえました。スムージーの具にすると言ったら優しく微笑んでくれました。<br />
<br />
ありがとう。<br />
<br />
<br />
おうちに帰る。
