# 結論の書き方をちゃんと指導教員は教えてくれましたでしょうか？
<!--:ja--><a href="http://blog.ueda.asia/?p=2586" title="パラグラフライティングについてあまりにも話題にならないので書く。" target="_blank">続編みたいなもの。（2014/4/3）</a><br />
<br />
どうも。世間は三連休らしいですね。<br />
<br />
国内というよりも国際学会の予稿の査読での方が正直酷いのですが、「結論 (conclusion)」がなんなのかよく分かってない研究者が結構な割合でいるように見受けられます。<br />
<br />
予稿の場合、どうしても雑になるのは分かりますが、たまに根本的に間違ってるのがあります。<br />
<br />
そういえば私も、序文の文をコピペして全部過去形にして先生に叱られて教育的指導を受けたから分かってるわけで、ちゃんと習わないと本人が優れていようがいまいが変な結論を書いてしまうということが考えられます。<br />
<br />
ということで、ちょろっと解説しておきます。<br />
<br />
<h2>議論のある文書には結論を書く</h2><br />
<br />
世の中には結論のある文書とない文書がありますが、その違いは議論の有無です。議論のある文書に議論の結果として結論があるわけです。<br />
<br />
ですので、結論には本編の議論が反映されている必要があります。結論に本編で触れていないことを書いてはいけません。<br />
<br />
ただ、議論をしても娯楽性が求められる文書というのもありますので、その場合は議論の骨組みは保ったまま娯楽性の大小に応じて崩します。もちろん、論文にはそのような崩しは不要です。<br />
<br />
世の中のライターには、崩しを認識してやっている人とそうでない人がいますので、そういう観点でこの人どうなんだろうと考えながら読むとちょっと面白いかもしれません。議論の軸を保ったまま崩せる人が、説得力と面白さを両立させられる人ということになります。修行が足らんな・・・。<br />
<br />
話がそれました。論文では当然、崩しをやってはいけません。結論の後の「future works」が、ちょっとだけ私見を言えるように用意されています。<br />
<br />
<h2>研究論文の結論には新しく分かったことを書く</h2><br />
<br />
で、論文は議論のある文書です。必ず議論があります。世の中に知られていないことを言って、それが正しいかどうか議論します。ですから、「議論の結果分かったこと」が書いていない論文は、論文としては読む価値がありません。<span style="color:red">序論を全て過去形にした結論は、つまりは何も分かったことが書いていないことになります。</span><br />
<br />
「議論の結果分かったこと」は、学者の世界では「知見」と呼ばれます。英語にするとknowledge です。つまり、論文の結論を読めば、これまで何十億人が知らなかったこと、あるいは検証されていなかったことが分かるように書いていないとウソです。<br />
<br />
ここで困るのが、国や研究の受託先、指導教員、その他誰かから、「とりあえず何か作れ」と言われた場合、あるいは「とりあえず何か作る」と宣言した場合です。そんなもん研究と呼べるかどうかは別の話題として、研究者としては研究にしなければなりません。このような場合でも、<br />
<br />
<ul><br />
	<li>作っている最中に新しい手法を見つけてそちらを主眼に論文を書く。</li><br />
 <li>新しいものを作ったらこれまで実現してはいなかったことができると判明したと書く。</li><br />
</ul><br />
<br />
という方法で論文を書きます。どちらも、正当な主張です。<br />
<br />
逆に言えば、どんな素晴らしいものを作っても上記の点が主張できなければそれは研究ではありません。ただ、論文を書くより商売に走る方が世の中的に価値のあることなので、あくまで論文という点で、ということになりますが、やはり議論のないものは無価値となります。<br />
<br />
学問という点においては、そのように知見を意識せずに言われたことをやるというのは、精神的に奴隷だということになります。もともと学問（リベラルアーツ）というのは奴隷的な精神の解放に起源があり・・・（くどいので割愛）。<br />
<br />
<h2>査読のされ方</h2><br />
<br />
忙しい人や私のように順番に読んでも一度で理解できないボンクラは、査読の際にまず結論を読みます。これはある意味正当です。なぜなら、結論を読めば知見が書いてあるからです。論文の価値は、「どんな知見があるか」にあります。知見の正当性を証明するためにその前の文章があるわけで、価値は結論に集中していないといけません。これはhow to本や教科書とは、論文が決定的に違う点です。<br />
<br />
ですから論文の素点は結論で決まって、大風呂敷を広げていたら前半をきっちりしらべます。序論で既出でないことを宣言しているか、詳細に提案することを説明しているか、実験や議論で提案事項の正当性を説明しているか、等々判断していくのですが、結論がつまらない（= 他の人が読んでも何の役にも立ちそうにない知見が書いてある）ならば、どれだけ前半がきっちりしていてもリジェクトの可能性は高くなります。<br />
<br />
ついでに書いておくと、<span style="color:red">査読というのはあら探しをするためにあるものではありません。</span>論文をパブリッシュしたときに得られるであろう知見や良い影響が大きいか小さいかを判断するためにあります。さすがに間違いを見つけたら落としたり修正を促しますが、間違いがすり抜けるよりも、良いアイデアがもみ消されることが一番良くないとされており、いくつかの学会ではねちっこいあら探しをしないようにと書いてあるものもあります（論文ならここで引用が必要ですが、割愛）。論文（thesis）はテーゼであり、そうであれば必ずアンチテーゼが許されるわけです。<br />
<br />
論文誌というのは結局のところ学者仲間で成果を共有しあうためにあるので、もし間違いがあっても学者仲間で追試することで長期的に内容の正当性を保つ仕組みになっています。そうでないと、「論文の〜〜〜は疑わしい（suspicious）」という、よく使われる論文での表現はありえないことになります。正反対の世界は、役所の無謬主義でしょう。そんなものは新しい知見を得ようとする人たちには邪魔にしかなりません。<br />
<br />
<h2>ということでどう書くか</h2><br />
<br />
んで結局どうかくかというと、基本は「分かったことを、なるべく具体的に、定量的に、箇条書きで」書きます。もちろん、結論より前に書いてあることを根拠とします。ていうか、何を調べたいか、結論にするかを準備してから実験なりアンケートをするわけで、結論を予測せずにダラダラと実験してはいけません。結論ありきのアンケートは誘導の可能性がありますが、やはり調べたいことを調べるためにアンケートがあるわけで、そこで公平性を担保するのが研究者の腕の見せ所です。<br />
<br />
そして結論は査読者や読者に対するプレゼンテーションで、歯切れが良い方が伝わるということになります。結論の冒頭は（異論があるかもしれませんが）序論の過去形でもよいのですが、その後に箇条書きで主張したいことを定量的、あるいはyesかnoで歯切れよく書きます。<br />
<br />
例（あくまで一例。具体的でないので例として自信は無い。）：<br />
<br />
<hr /><br />
<br />
<blockquote><br />
本研究では××を提案した。××がhogehogeを理論的背景としていることを説明し、fugefugeへの応用の方法を示した。本論文での実験および考察において得られた知見を以下に示す。<br />
<ul><br />
 <li>実験において××と○○を▲の点で比較したところ、××が○○よりも40%、▲に効果的</li><br />
 <li>fugefugeへの応用においては、zzzがxxの安定性に効果的</li><br />
 <li>○○はaaa実験において5%の成功率となり、fugefugeへの応用に適していない</li><br />
</ul><br />
今後は、以下について調査する。<br />
<ul><br />
 <li>aaa</li><br />
 <li>bbb</li><br />
</ul><br />
</blockquote><br />
<hr /><br />
<br />
<h2>本記事の結論</h2><br />
<br />
本記事では結論の書き方について、論文における結論の存在意義や査読のされ方、その他私見を交えて解説した。序論を過去形にして知見を書いていない論文が筆者の経験上、一定の割合で存在するため、このような解説は有益と考えられる。本記事は論文ではないため裏付けに乏しいものの、本記事で読者に与えるであろう知見を以下に示す。<br />
<br />
<ul><br />
 <li>一般的な文書において結論が存在する場合、その文書は議論を行っており、結論はその議論についてなんらかの結果を示すものとなる。</li><br />
 <li>研究論文の結論には、これまでの数十億人の人間が知り得なかった知見を、読者に分かりやすいように歯切れよく具体的に書く。</li><br />
 <li>結論は箇条書き等、査読者や読者にプレゼンテーションを意識した形式にする。</li><br />
</ul><br />
<br />
<br />
今後については、とりあえず寝る。<br />
<br />
・・・じゃなかった。読者や筆者の間で議論を行い、私が査読したときに負担の少ない論文、本数稼ぎと推測されない論文の割合を増やすことを目指す。あと、俺もちゃんと論文を書く・・・。<!--:-->
