# ちなみに、スクリプトとは、掲示板を荒らすためのプログラムのこと。
その昔、「独自言語パイソン」というのがありましたが、またその手の記事です。大人げないけど、シェルスクリプター（？）としては看過できません。<br />
<br />
<a href="http://news.nicovideo.jp/watch/nw881581" target="_blank">「ちなみに、スクリプトとは、掲示板を荒らすためのプログラムのこと。」</a><br />
<br />
<!--more--><br />
<br />
たいていこういう文章は全文を読めばなんらかの事情があってこういう言い回しになったんだと分かるんですが、これについてはたぶん「スクリプト」という用語について最初から気配りがないか、普段は用語の使い方に気をつけているのに何か事情があってうっかり出しちゃったかどっちかです。私も弱っているときは間違えるので、間違いは間違いでしょうがないですが・・・。<br />
<br />
私、こういう揚げ足取りは好きではありませんが、一つ考えていることがありまして・・・。コンピュータやプログラミングに造形の深い人をちゃんと記者として雇ってほしいと。そういうキャリアパスがないような気がするんです。人を雇うときに、そういった外の知識に期待するのではなく、仲良しグループで閉じているんじゃないでしょうか。これはなんかこう、日頃考えている事なので書いてもばちは当たらないかと。それが言いたいがための指摘です。<br />
<br />
最後、人は間違えるものなので、ちゃんと訂正が入れば別にたいしたことではないとは明記しておきます。<br />
<br />
ところで、シェル芸ならスクリプトが残りません。攻撃し放題。いや、かならずどこかにログが残るのでやめましょう。<br />
<br />
<br />
あなかしこ。
