# 雑記（2017年9月5日）
<h3>今日の仕事</h3><br />
<br />
まだ公表できない案件。久しぶりに書き進んだ。<br />
<br />
<h3>プルリクエスト</h3><br />
<br />
またraspimouse_ros_2にいただいた。ありがたや。<br />
<br />
<h3>ICRA</h3><br />
<br />
とりあえず6ページ書いたがこのままだと落ちる。<br />
<br />
<h3>今日の不注意</h3><br />
<br />
ハンカチを保育園バックから取り出したらパンツだった。次女に大陳謝。<br />
<br />
<h3>ピーナッツアレルギー</h3><br />
<br />
ちょうど一年前くらいに自身にピーナッツアレルギーがあるのではないかと思ってピーナッツ断ちをして1年。久しぶりにチョコボールのピーナッツ味を食べた。食べてから12時間経過。まだ顔がかゆい。1年の時を経てピーナッツアレルギー決定。<br />
<br />
しかしこれ、花粉症よりかなり軽度なのだが、アナフィラキシーショックとかは心配しなくていいのだろうか？<br />
<br />
<h3>Jupyter Notebookとロボットのつなぎこみ</h3><br />
<br />
研究室の佐藤さんの仕事。研究室のページにも書かなくては。今も改良中の模様。<br />
<br />
<br />
<br />
<iframe width="560" height="315" src="https://www.youtube.com/embed/KiiLwgnJNnQ" frameborder="0" allowfullscreen></iframe><br />
<br />
<br />
風呂に入る。
